{
    "products": [
      {
        "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQNxz7ME3co2srxMGV96yNiEzwYRzqSyJfKjg&usqp=CAU",
        "id": 1,
        "title": "Apple iPhone 12 (64GB) - Red",
        "price": 73990,
        "description": " Blast past fast. A14 Bionic, the fastest chip in a smartphone. An edge-to-edge OLED display. Ceramic Shield with four times better drop performance.",
        "rating": 4
      },
      {
        "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQs0BWcm-pGRzQS5WHjWjCaYMlUPSHLsvdlzA&usqp=CAU",
        "id": 2,
        "title": "MacBook Air (M1, 2020) - Space Grey",
        "price": 92990,
        "description": "MacBook Air with Apple M1 chip. Apple's thinnest and lightest notebook gets supercharged with the Apple M1 chip. Go longer than ever with up to 18 hours of battery life ",
        "rating": 4.5
      },
      {
        "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSyXm_1eIhGoRMUa9YnxRRp53c00cN3OkbK2A&usqp=CAU",
        "id": 3,
        "title": "Samsung Galaxy Note20 Ultra 5G",
        "price": 104999,
        "description": "The Samsung Galaxy Note 20 Ultra 5G is extremely expensive but offers the best of Samsung's technology including a 108-megapixel camera, massive Dynamic AMOLED display, One UI 2.5 designed for everyday simplicity .",
        "rating": 5
      },
      {
        "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRJfHTjCSTk1n3uBVwvdE00BqEdfpQtN7_mnQ&usqp=CAU",
        "id": 4,
        "title": "Apple iPad Air - Space Grey (Latest Model)",
        "price": 40999,
        "description": "This is the same feeling you will experience if once you get your hands on this Apple iPad Air that features a 10.5 inch (26.67 cm) retina screen.iPad Air is the perfect way to stay connected with Wi‑Fi and 4G LTE.And Up to 10 hours of battery life",
        "rating": 4
      },
      {
        "img": "https://images-na.ssl-images-amazon.com/images/I/A1A2yQlAXCL._SL1500_.jpg",
        "id": 5,
        "title": "ASUS TUF Gaming A15 Laptop",
        "price": 96990,
        "description": "Geared for serious gaming and real-world durability, the TUF Gaming A15 is a fully-loaded Windows 10 gaming laptop that can carry you to victory. Powered by the latest AMD Ryzen 9 CPU and GeForce GTX 1660 Ti GPU, action-packed gameplay is fast, fluid, and fully saturates speedy IPS-level displays up to 144Hz. Even while boasting a smaller and more portable chassis than its predecessors.",
        "rating": 4
      },
      {
        "img": "https://images-na.ssl-images-amazon.com/images/I/71rhrO49SmL._SL1500_.jpg",
        "id": 6,
        "title": "Apple Watch SE (GPS, 44mm) - Space Grey",
        "price": 32990,
        "description": "Track your daily activity on Apple Watch and see your trends in the Fitness app on iPhone. Measure workouts like running, walking, cycling, yoga, swimming, and dance. High and low heart rate notifications and irregular heart rhythm notification",
        "rating": 5
      }
    ]
  }